#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

module.azure_bot.azuread_application.application: Refreshing state... [id=/applications/54590f24-4a67-4492-8021-23e2c51db364]
module.azure_bot.azurerm_resource_group.azure_bot_rg: Refreshing state... [id=/subscriptions/0dccf176-bf7a-4786-8290-4fa07326175a/resourceGroups/koichi-furukawa-example-1-rg-prod]
module.azure_bot.azurerm_bot_service_azure_bot.azure_bot: Refreshing state... [id=/subscriptions/0dccf176-bf7a-4786-8290-4fa07326175a/resourceGroups/koichi-furukawa-example-1-rg-prod/providers/Microsoft.BotService/botServices/koichi-furukawa-example-1-bot-prod]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.azure_bot.azuread_application.application will be updated in-place
  ~ resource "azuread_application" "application" {
      ~ display_name                   = "koichi-furukawa-example-1-prod" -> "koichi-furukawa-example-2-prod"
        id                             = "/applications/54590f24-4a67-4492-8021-23e2c51db364"
        tags                           = []
        # (15 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.azure_bot.azuread_application_password.example will be created
  + resource "azuread_application_password" "example" {
      + application_id        = "/applications/54590f24-4a67-4492-8021-23e2c51db364"
      + application_object_id = (known after apply)
      + display_name          = "koichi-furukawa-example-2-prod-client-secret"
      + end_date              = (known after apply)
      + id                    = (known after apply)
      + key_id                = (known after apply)
      + rotate_when_changed   = (known after apply)
      + start_date            = (known after apply)
      + value                 = (sensitive value)
    }

  # module.azure_bot.azurerm_bot_service_azure_bot.azure_bot must be replaced
-/+ resource "azurerm_bot_service_azure_bot" "azure_bot" {
      ~ display_name                 = "koichi-furukawa-example-1-bot-prod" -> (known after apply)
      ~ id                           = "/subscriptions/0dccf176-bf7a-4786-8290-4fa07326175a/resourceGroups/koichi-furukawa-example-1-rg-prod/providers/Microsoft.BotService/botServices/koichi-furukawa-example-1-bot-prod" -> (known after apply)
      - luis_app_ids                 = [] -> null
      ~ name                         = "koichi-furukawa-example-1-bot-prod" -> "koichi-furukawa-example-2-bot-prod" # forces replacement
      ~ resource_group_name          = "koichi-furukawa-example-1-rg-prod" -> "koichi-furukawa-example-2-rg-prod" # forces replacement
      - tags                         = {} -> null
        # (7 unchanged attributes hidden)
    }

  # module.azure_bot.azurerm_resource_group.azure_bot_rg must be replaced
-/+ resource "azurerm_resource_group" "azure_bot_rg" {
      ~ id       = "/subscriptions/0dccf176-bf7a-4786-8290-4fa07326175a/resourceGroups/koichi-furukawa-example-1-rg-prod" -> (known after apply)
      ~ name     = "koichi-furukawa-example-1-rg-prod" -> "koichi-furukawa-example-2-rg-prod" # forces replacement
      - tags     = {} -> null
        # (1 unchanged attribute hidden)
    }

  # module.azure_bot.time_rotating.example will be created
  + resource "time_rotating" "example" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 365
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

Plan: 4 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @kooooichi24, Action: `pull_request`, Working Directory: `./prod`, Workflow: `Terraform Plan`*